{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "1024"}, {"size": "3"}]}}, "args_1": {"name": "args_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "2"}, {"size": "2"}]}}, "args_2": {"name": "args_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "2"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "-1"}, {"size": "1024"}, {"size": "1024"}]}}, "output_2": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1024"}, {"size": "1024"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "2"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/neck/3/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/neck/1/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc2/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc2/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc2/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc2/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc2/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/Gelu/mul/x", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/Gelu/add/x", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc1/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc1/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc1/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc1/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/mlp/fc1/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/layer_norm2/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/proj/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/proj/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/proj/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/proj/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/proj/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/mul/y", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/Tensordot/free", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/Tensordot/GatherV2/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/Tensordot/Const_2", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/Tensordot/concat_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/qkv/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/Reshape/shape/1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/Reshape/shape/2", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/Reshape/shape/3", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/Reshape/shape/4", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/transpose/perm", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/attn/transpose_2/perm", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.11/layer_norm1/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc2/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc2/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc2/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc2/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc2/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/Gelu/mul/x", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/Gelu/add/x", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc1/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc1/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc1/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc1/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/mlp/fc1/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/layer_norm2/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/proj/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/proj/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/proj/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/proj/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/proj/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/mul/y", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "576"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/Tensordot/free", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/Tensordot/GatherV2/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/Tensordot/Const_2", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/Tensordot/concat_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/qkv/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/Reshape/shape/1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/Reshape/shape/2", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/Reshape/shape/3", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/Reshape/shape/4", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/transpose/perm", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/attn/transpose_2/perm", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.10/layer_norm1/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc2/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc2/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc2/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc2/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc2/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/Gelu/mul/x", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/Gelu/add/x", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc1/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc1/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc1/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc1/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/mlp/fc1/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/layer_norm2/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/proj/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/proj/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/proj/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/proj/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/proj/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/mul/y", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/Tensordot/free", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/Tensordot/GatherV2/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/Tensordot/Const_2", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/Tensordot/concat_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/qkv/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/Reshape/shape/1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/Reshape/shape/2", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/Reshape/shape/3", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/Reshape/shape/4", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/transpose/perm", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/attn/transpose_2/perm", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.9/layer_norm1/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc2/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc2/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc2/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc2/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc2/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/Gelu/mul/x", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/Gelu/add/x", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc1/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc1/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc1/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc1/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/mlp/fc1/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/layer_norm2/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/proj/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/proj/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/proj/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/proj/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/proj/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/mul/y", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/Tensordot/free", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/Tensordot/GatherV2/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/Tensordot/Const_2", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/Tensordot/concat_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/qkv/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/Reshape/shape/1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/Reshape/shape/2", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/Reshape/shape/3", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/Reshape/shape/4", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/transpose/perm", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/attn/transpose_2/perm", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.8/layer_norm1/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc2/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc2/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc2/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc2/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc2/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/Gelu/mul/x", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/Gelu/add/x", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc1/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc1/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc1/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc1/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/mlp/fc1/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/layer_norm2/batchnorm/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/proj/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/proj/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/proj/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/proj/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/proj/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/mul/y", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/qkv/Tensordot/Const", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/qkv/Tensordot/axes", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/qkv/Tensordot/GatherV2_1/axis", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/qkv/Tensordot/Const_1", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/qkv/Tensordot/ReadVariableOp", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/qkv/Tensordot/free", "op": "Const", "input": ["^args_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/efficient_sam/StatefulPartitionedCall/image_encoder/blocks.7/attn/qkv/Tensordot/GatherV2/axis", "op": "Const", "input": ["^args_0"], "attr": {"value": {"tensor": {"dtype": 